Results/Aesop_Apis_Baseline_test_Results/Substitute_Get_Apis/2022-02-07_20-13-47.192548_400_Users_Substitute_Get_Apis_08_Feb_2022/merged.yml
---
execution:
- concurrency: 400
  hold-for: 60m
  ramp-up: 400s
  scenario: SC01_Substitute_get_apis
modules:
  console:
    disable: true
reporting:
- criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed
  module: passfail
scenarios:
  SC01_Substitute_get_apis:
    script: SC01_Substitute_get_apis.jmx